ProgessBase/Catalogs/СоглашенияОбИспользованииЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>СоглашенияОбИспользованииЭД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияФорматаПакета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВерсииФорматаПакетаЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольFTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПассивноеСоединениеFTP</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательFTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортFTP</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьСертификатыПодписей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммаБанка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПрограммыБанка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РесурсВходящихДокументов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РесурсИсходящихДокументов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СертификатКонтрагентаДляШифрования</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СертификатОрганизацииДляРасшифровки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СертификатыЭЦП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОбменаЭД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОбменаЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСоглашения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСоглашенийЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТиповоеСоглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияОбИспользованииЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЛогинАбонента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПартнер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСертификатАбонента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СертификатыЭЦП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоИнтеркампани</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоТиповое</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВходящиеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВходящийДокумент</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЭД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользоватьЭЦП</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОжидатьКвитанциюОДоставке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формировать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсходящиеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИсходящийДокумент</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЭД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользоватьЭЦП</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОжидатьКвитанциюОДоставке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формировать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВерсияФормата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СертификатыПодписейКонтрагента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отпечаток</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сертификат</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФорматыФайловОбмена</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФорматФайла</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ФорматыФайловОбменаЭД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СертификатыПодписейОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сертификат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СертификатыЭЦП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКонтейнера</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ProgessBase/Enums/СпособыОбменаЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СпособыОбменаЭД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЧерезКаталог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧерезОператораЭДОТакском</Name>
					<Comment>Через оператора электронного документооборота Такском</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧерезЭлектроннуюПочту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧерезВебРесурсБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧерезFTP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БыстрыйОбмен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ProgessBase/Catalogs/СоглашенияОбИспользованииЭД/Forms/ФормаСписка/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Прочие

&НаКлиенте
Процедура ОткрытьФормуСоглашения(ИмяОткрываемойФормы, ПараметрыОткрываемойФормы)
	
	ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыОткрываемойФормы);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ СписокИнтеркампани

&НаКлиенте
Процедура СписокИнтеркампаниПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	Параметр = ?(Копирование, Новый Структура("ЗначениеКопирования", Элементы.СписокИнтеркампани.ТекущаяСтрока),
		Новый Структура);
	
	ОткрытьФорму("Справочник.СоглашенияОбИспользованииЭД.Форма.ФормаЭлементаИнтеркампани", Параметр,
		Элементы.СписокИнтеркампани);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокИнтеркампаниПередНачаломИзменения(Элемент, Отказ)
	
	ОткрытьФормуСоглашения("Справочник.СоглашенияОбИспользованииЭД.Форма.ФормаЭлементаИнтеркампани",
		Новый Структура("Ключ", Элементы.СписокИнтеркампани.ТекущаяСтрока));
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ СписокСоглашенийЧерезОЭДО

&НаКлиенте
Процедура СписокСоглашенийЧерезОЭДОПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	Если Копирование Тогда
		СтруктураПараметров = Новый Структура("ЗначениеКопирования", Элементы.СписокСоглашенийЧерезОЭДО.ТекущаяСтрока);
		ОткрытьФорму("Справочник.СоглашенияОбИспользованииЭД.Форма.ФормаЭлементаЧерезОЭДО",
					 СтруктураПараметров,
					 Элементы.СписокСоглашенийЧерезОЭДО);
	Иначе
		ОткрытьФорму("Справочник.СоглашенияОбИспользованииЭД.Форма.ПомощникНового",,ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСоглашенийЧерезОЭДОПередНачаломИзменения(Элемент, Отказ)
	
	ОткрытьФормуСоглашения("Справочник.СоглашенияОбИспользованииЭД.Форма.ФормаЭлементаЧерезОЭДО",
		Новый Структура("Ключ", Элементы.СписокСоглашенийЧерезОЭДО.ТекущаяСтрока));
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ СписокСоглашенийСБанками

&НаКлиенте
Процедура СписокСоглашенийСБанкамиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	Параметр = ?(Копирование, Новый Структура("ЗначениеКопирования", Элементы.СписокСоглашенийСБанками.ТекущаяСтрока), Новый Структура);
	ОткрытьФорму("Справочник.СоглашенияОбИспользованииЭД.Форма.ФормаЭлементаБанк", Параметр, Элементы.СписокСоглашенийСБанками);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСоглашенийСБанкамиПередНачаломИзменения(Элемент, Отказ)
	
	ОткрытьФормуСоглашения("Справочник.СоглашенияОбИспользованииЭД.Форма.ФормаЭлементаБанк",
		Новый Структура("Ключ", Элементы.СписокСоглашенийСБанками.ТекущаяСтрока));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСоглашенийПередНачаломИзменения(Элемент, Отказ)
	
	СтруктураРеквизитов = ЭлектронныеДокументыСлужебныйВызовСервера.СпособОбмена_ПризнакИнтеркампани_Соглашения(Элементы.СписокСоглашений.ТекущаяСтрока);
	
	Если СтруктураРеквизитов.ЭтоИнтеркампани Тогда
		ОткрытьФормуСоглашения("Справочник.СоглашенияОбИспользованииЭД.Форма.ФормаЭлементаИнтеркампани",
			Новый Структура("Ключ", Элементы.СписокСоглашений.ТекущаяСтрока));
	ИначеЕсли СтруктураРеквизитов.СпособОбменаЭД = ПредопределенноеЗначение("Перечисление.СпособыОбменаЭД.ЧерезОператораЭДОТакском") Тогда
		ОткрытьФормуСоглашения("Справочник.СоглашенияОбИспользованииЭД.Форма.ФормаЭлементаЧерезОЭДО",
			Новый Структура("Ключ", Элементы.СписокСоглашений.ТекущаяСтрока));
	ИначеЕсли СтруктураРеквизитов.СпособОбменаЭД = ПредопределенноеЗначение("Перечисление.СпособыОбменаЭД.ЧерезВебРесурсБанка") Тогда
		ОткрытьФормуСоглашения("Справочник.СоглашенияОбИспользованииЭД.Форма.ФормаЭлементаБанк",
			Новый Структура("Ключ", Элементы.СписокСоглашений.ТекущаяСтрока));
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЭлектронныеДокументыСлужебныйВызовСервера.ПолучитьЗначениеФункциональнойОпции("ИспользоватьОбменЭД") Тогда
		ТекстСообщения = ЭлектронныеДокументыСлужебныйВызовСервера.ТекстСообщенияОНеобходимостиНастройкиСистемы("РаботаСЭД");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		Возврат;
	КонецЕсли;
	
	СпособыОЭДНапрямую = ЭлектронныеДокументыСлужебный.МассивСпособовОбменаЭД(Истина);
	ДатаАктуальности = НачалоДня(ТекущаяДатаСеанса());
	
	ИмяСправочникаБанки = ЭлектронныеДокументыПовтИсп.ПолучитьИмяПрикладногоСправочника("Банки");
	Если ЗначениеЗаполнено(ИмяСправочникаБанки) Тогда
		СписокСоглашенийСБанками.ТекстЗапроса = СтрЗаменить(СписокСоглашенийСБанками.ТекстЗапроса,
															"КлассификаторБанковРФ",
															ИмяСправочникаБанки);
	КонецЕсли;
	
	ТекстЗапросаПартнеры = "ИСТИНА";
	Если ЭлектронныеДокументыПовтИсп.ИспользуетсяДополнительнаяАналитикаКонтрагентовСправочникПартнеры()
		И Параметры.Свойство("Партнер") Тогда
		
		ТекстЗапросаПартнеры = "ВЫБОР
		|	КОГДА Соглашение.Контрагент.Партнер В ИЕРАРХИИ (&Партнер)
		|		ТОГДА ИСТИНА
		|	ИНАЧЕ ЛОЖЬ
		|КОНЕЦ";
		
		СписокСоглашенийСКонтрагентами.Параметры.УстановитьЗначениеПараметра("Партнер",            Параметры.Партнер);
		СписокСоглашенийМеждуОрганизациями.Параметры.УстановитьЗначениеПараметра("Партнер",        Параметры.Партнер);
		СписокСоглашенийЧерезОЭДО.Параметры.УстановитьЗначениеПараметра("Партнер",                 Параметры.Партнер);
	КонецЕсли;
	СписокСоглашенийСКонтрагентами.ТекстЗапроса = СтрЗаменить(СписокСоглашенийСКонтрагентами.ТекстЗапроса,
		"&Партнер", ТекстЗапросаПартнеры);
	СписокСоглашенийМеждуОрганизациями.ТекстЗапроса = СтрЗаменить(СписокСоглашенийМеждуОрганизациями.ТекстЗапроса,
		"&Партнер", ТекстЗапросаПартнеры);
	СписокСоглашенийЧерезОЭДО.ТекстЗапроса = СтрЗаменить(СписокСоглашенийЧерезОЭДО.ТекстЗапроса,
		"&Партнер", ТекстЗапросаПартнеры);
	
	СписокСоглашенийСКонтрагентами.Параметры.УстановитьЗначениеПараметра("ДатаАктуальности",        ДатаАктуальности);
	СписокСоглашенийСКонтрагентами.Параметры.УстановитьЗначениеПараметра("Контрагент",              Параметры.Контрагент);
	СписокСоглашенийСКонтрагентами.Параметры.УстановитьЗначениеПараметра("Организация",             Параметры.Организация);
	СписокСоглашенийСКонтрагентами.Параметры.УстановитьЗначениеПараметра("СпособыОбменаЭДНапрямую", СпособыОЭДНапрямую);
	
	СписокСоглашенийМеждуОрганизациями.Параметры.УстановитьЗначениеПараметра("ДатаАктуальности",     ДатаАктуальности);
	СписокСоглашенийМеждуОрганизациями.Параметры.УстановитьЗначениеПараметра("Контрагент",           Параметры.Контрагент);
	СписокСоглашенийМеждуОрганизациями.Параметры.УстановитьЗначениеПараметра("Организация",          Параметры.Организация);
	
	СписокСоглашенийЧерезОЭДО.Параметры.УстановитьЗначениеПараметра("ДатаАктуальности",        ДатаАктуальности);
	СписокСоглашенийЧерезОЭДО.Параметры.УстановитьЗначениеПараметра("Контрагент",              Параметры.Контрагент);
	СписокСоглашенийЧерезОЭДО.Параметры.УстановитьЗначениеПараметра("Организация",             Параметры.Организация);
	
	СписокСоглашенийСБанками.Параметры.УстановитьЗначениеПараметра("ДатаАктуальности", ДатаАктуальности);
	СписокСоглашенийСБанками.Параметры.УстановитьЗначениеПараметра("Банк",             Параметры.Банк);
	СписокСоглашенийСБанками.Параметры.УстановитьЗначениеПараметра("Организация",      Параметры.Организация);
	
	СписокСоглашений.Параметры.УстановитьЗначениеПараметра("ДатаАктуальности", ДатаАктуальности);
	
	// Скроем группу "Всех соглашений" от пользователей с ограниченными правами или принудительно.
	СкрытьЗакладкуВсехСоглашений = НЕ ПользователиСервер.ЭтоПолноправныйПользовательИБ()
									ИЛИ (Параметры.Свойство("Партнер") И ЗначениеЗаполнено(Параметры.Партнер))
									ИЛИ ЗначениеЗаполнено(Параметры.Контрагент)
									ИЛИ ЗначениеЗаполнено(Параметры.Организация)
									ИЛИ ЗначениеЗаполнено(Параметры.Банк);

	Если ЗначениеЗаполнено(Параметры.Банк) Тогда
		Элементы.ГруппаСоглашения.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		Элементы.ГруппаСоглашения.ТекущаяСтраница    = Элементы.ГруппаСоглашенияСБанками;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.Контрагент)
		ИЛИ (Параметры.Свойство("Партнер")И ЗначениеЗаполнено(Параметры.Партнер)) Тогда
		
		Элементы.ГруппаСоглашенияСБанками.Видимость = Ложь;
	КонецЕсли;

	Элементы.ГруппаВсеСоглашения.Видимость = НЕ СкрытьЗакладкуВсехСоглашений;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовое(Команда)
	
	ОткрытьФорму("Справочник.СоглашенияОбИспользованииЭД.Форма.ФормаЭлементаЧерезОЭДО", , ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		Элементы.СписокСоглашенийЧерезОЭДО.Обновить();
	КонецЕсли;
	
КонецПроцедуры
